Interpreters/1994-Graham-Query.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>1994-Graham-Query</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-16 13:10:30 EDT"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">1994-Graham-Query</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 A Query Interpreter </a>
<ul>
<li>
<ul>
<li><a href="#sec-1.1">1.1 (defmacro with-answer (query &amp;body body)) </a></li>
<li><a href="#sec-1.2">1.2 (defmacro interpret-query (expr &amp;optional binds)) </a></li>
<li><a href="#sec-1.3">1.3 (defun interpret-and (clauses binds)) </a></li>
<li><a href="#sec-1.4">1.4 (defun interpret-or (clauses binds)) </a></li>
<li><a href="#sec-1.5">1.5 (defun interpret-not (clause binds)) </a></li>
<li><a href="#sec-1.6">1.6 (defun lookup (pred args &amp;optional binds)) </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> A Query Interpreter </h2>
<div class="outline-text-2" id="text-1">

<p>The central function in this code is <code>interpret-query</code>,
which recursively works through the structure of a 
complex query, generating bindings in the process.
</p>
<p>
A sample usage of the Interpreter looks something
like this:
</p>



<pre class="example">(lookup 'painter '(?x ?y english))

(interpret-query '(and (painter ?x ?y ?z)
                       (dates ?x 1697 ?w)))
</pre>






</div>

<div id="outline-container-1.1" class="outline-4">
<h4 id="sec-1.1"><span class="section-number-4">1.1</span> (defmacro with-answer (query &amp;body body)) </h4>
<div class="outline-text-4" id="text-1.1">

</div>

</div>

<div id="outline-container-1.2" class="outline-4">
<h4 id="sec-1.2"><span class="section-number-4">1.2</span> (defmacro interpret-query (expr &amp;optional binds)) </h4>
<div class="outline-text-4" id="text-1.2">

</div>

</div>

<div id="outline-container-1.3" class="outline-4">
<h4 id="sec-1.3"><span class="section-number-4">1.3</span> (defun interpret-and (clauses binds)) </h4>
<div class="outline-text-4" id="text-1.3">

</div>

</div>

<div id="outline-container-1.4" class="outline-4">
<h4 id="sec-1.4"><span class="section-number-4">1.4</span> (defun interpret-or (clauses binds)) </h4>
<div class="outline-text-4" id="text-1.4">

</div>

</div>

<div id="outline-container-1.5" class="outline-4">
<h4 id="sec-1.5"><span class="section-number-4">1.5</span> (defun interpret-not (clause binds)) </h4>
<div class="outline-text-4" id="text-1.5">

</div>

</div>

<div id="outline-container-1.6" class="outline-4">
<h4 id="sec-1.6"><span class="section-number-4">1.6</span> (defun lookup (pred args &amp;optional binds)) </h4>
<div class="outline-text-4" id="text-1.6">


</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-06-16 13:10:30 EDT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
